Enums/СтатусыЗаявленийИРеестровНаВыплатуПособий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявленийИРеестровНаВыплатуПособий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданВФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринятФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыОтправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыОтправки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВКонверте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятЕстьОшибки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЗаявленийИРеестровНаВыплатуПособий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СтатусыПозволяющиеРедактироватьДокументы() Экспорт
	Массив = Новый Массив;
	Массив.Добавить(ПустаяСсылка());
	Массив.Добавить(ВРаботе);
	Массив.Добавить(Подготовлен);
	Массив.Добавить(НеПринятФСС);
	Массив.Добавить(Аннулирован);
	Возврат Массив;
КонецФункции

Функция СтатусыНеПозволяющиеРедактироватьДокументы() Экспорт
	Массив = Новый Массив;
	Массив.Добавить(ПереданВФСС);
	Массив.Добавить(ПринятФСС);
	Возврат Массив;
КонецФункции

// Превращает состояние отправки регламентированного отчета в состояние реестра прямых выплат.
//
// Параметры:
//   СтатусОтправки - ПеречислениеСсылка.СтатусыОтправки
//
// Возвращаемое значение:
//   ПеречислениеСсылка.СтатусыЗаявленийИРеестровНаВыплатуПособий
//
Функция ИзСтатусаОтправки(СтатусОтправки) Экспорт
	СостоянияБРО = Перечисления.СтатусыОтправки;
	Если СтатусОтправки = СостоянияБРО.Доставлен Тогда
		Возврат ПереданВФСС;
	ИначеЕсли СтатусОтправки = СостоянияБРО.Отправлен Тогда
		Возврат ПереданВФСС;
	ИначеЕсли СтатусОтправки = СостоянияБРО.Сдан Тогда
		Возврат ПринятФСС;
	ИначеЕсли СтатусОтправки = СостоянияБРО.НеПринят Тогда
		Возврат НеПринятФСС;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецЕсли
